        org 0x423
        ;; Строка для ввода: По своей сути идентично выражению «
        ;; ISO 8859-5        BFDE20E1D2DED5D920E1E3E2D820D8D4D5DDE2D8E7DDDE20D2EBE0D0D6D5DDD8EE2022
        ;; UTF-8             041FD0EB0020D0BFD0B2D0BED0B5D0B90020D181D183D182D0B80020D0B8D0B4D0B5D0BDD182D0B8D187D0BDD0BE0020D0B2D18BD180D0B0D0B6D0B5D0BDD0B8D18E00200022
        ;; UTF-8 site        d09fd0be20d181d0b2d0bed0b5d0b920d181d183d182d0b820d0b8d0b4d0b5d0bdd182d0b8d187d0bdd0be20d0b2d18bd180d0b0d0b6d0b5d0bdd0b8d18e20c2ab
        ;; UTF-16 site       041f043e002004410432043e04350439002004410443044204380020043804340435043d044204380447043d043e00200432044b0440043004360435043d0438044e002000ab
        ;; Количество символов: 35 (23 в 16СС)
R:      word 0x556              ;Указатель на результат.
W:      word 0x00               ;Ячейка, используемая программой.
START:  CLA                     ;Очистка аккумулятора.
S1:     IN 7                    ;Проверка готовности ВУ.
        AND #0x40               ;Проверка наличия символа готовности с ВУ.
        BZS S1                  ;Возврат к проверке готовности ВУ, если символа нет.
        IN 6                    ;Чтение введенного символа с ВУ в младший байт аккумулятора.
        ST (R)+                 ;Загрузка в ячейку результата полученного слова, инкрементируя указатель.
        ST W                    ;Сохранение введенного символа в ячейку временных данных.
        CMP 0x0000              ;Проверка, является введенный символ нулем.
        BZS HALT                ;Переход на останов, если введенный символ является стоп-символом.
S2:     IN 7                    ;Проверка готовности ВУ.
        AND #0x40               ;Проверка наличия символа готовности с ВУ.
        BZS S2                  ;Возврат к проверке готовности ВУ, если символа нет.
        IN 6                    ;Чтение введенного символа с ВУ в младший байт аккумулятора.
        SWAB                    ;Перемещение символа в старший байт аккумулятора.
        ST (R)                  ;Сохранение введенного символа в ячейку результата.
        LD W                    ;Загрузка оставшихся символов ячейку временных данных.
        DEC                     ;Уменьшение количества символов на 1.
        ST W                    ;Сохранение длины строки.
        BZS HALT                ;Переход на останов, если количество символов, которые надо ввести равно нулю.
S3:     IN 7                    ;Проверка готовности ВУ.
        AND #0x40               ;Проверка наличия символа готовности с ВУ.
        BZS S3                  ;Возврат к проверке готовности ВУ, если символа нет.
        IN 6                    ;Чтение введенного символа с ВУ в младший байт аккумулятора.
        OR (R)                  ;Добавление в аккумулятор первый введенный символ.
        ST (R)+                 ;Загрузка в ячейку результата полученного слова, инкрементируя указатель.
        LOOP W                  ;Уменьшение переменной W на 1. Если > 0, переход на ожидание первого
                                ;символа. 
        JUMP S2
HALT:   HLT                     ;Останов.
